# Introduction to Pandas

Pandas is a high level fata manipulation package which was built on top of Numpy. The key structures within pandas include Series and Dataframes

## Series

A series is a one-dimensional array with axis labels. A series is a ndarray, thus it is homogeneous and cannot store multiple dtypes.

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
x = pd.Series([10,20,30,40,50])
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [6]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
x.values

array([10, 20, 30, 40, 50])

In [8]:
x.dtype

dtype('int64')

In [11]:
# Creating series with an index

data = [450, 650, 870]
sales = Series(data, index=["Don", "Mike", "Edwin"])

In [12]:
sales

Don      450
Mike     650
Edwin    870
dtype: int64

In [13]:
type(sales)

pandas.core.series.Series

In [14]:
sales.index

Index(['Don', 'Mike', 'Edwin'], dtype='object')

## Accessing Values

In [17]:
sales["Don"]

np.int64(450)

In [18]:
sales[0]

C:\Users\vidus\AppData\Local\Temp\ipykernel_20412\1101347017.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  sales[0]

np.int64(450)

In [20]:
sales.iloc[0]

np.int64(450)

## Checking for conditions

In [21]:
sales > 500

Don      False
Mike      True
Edwin     True
dtype: bool

In [22]:
sales[[False, True, True]]

Mike     650
Edwin    870
dtype: int64

In [23]:
sales[sales>500]

Mike     650
Edwin    870
dtype: int64

In [25]:
"Sally" in sales

False

In [27]:
450 in sales
# 450 is not an index, it is a value. Hence this ouputs False

False

### Working with Dictionaries

In [29]:
# Converting series to dictionary

sales_dict = sales.to_dict()

In [30]:
sales_dict

{'Don': 450, 'Mike': 650, 'Edwin': 870}

In [31]:
# Converting dictionary to series
sales_ser = Series(sales_dict)
sales_ser

Don      450
Mike     650
Edwin    870
dtype: int64

### Adding enties and working with NaN/null values

In [35]:
# If indesx doesn't already have value, it is set to NaN by default
new_sales = Series(sales, index=["Don", "Mike", "Sally", "Edwin", "Lucy"])

In [36]:
new_sales

Don      450.0
Mike     650.0
Sally      NaN
Edwin    870.0
Lucy       NaN
dtype: float64

In [37]:
np.isnan(new_sales)

Don      False
Mike     False
Sally     True
Edwin    False
Lucy      True
dtype: bool

In [38]:
# To check for null values use pandas
pd.isnull(new_sales)

Don      False
Mike     False
Sally     True
Edwin    False
Lucy      True
dtype: bool

### Naming Components in a Series

In [40]:
sales.index.name = "Sales Person"

In [41]:
sales

Sales Person
Don      450
Mike     650
Edwin    870
dtype: int64

In [42]:
# NMaming a series
sales.name = "Total Sales"
sales

Sales Person
Don      450
Mike     650
Edwin    870
Name: Total Sales, dtype: int64

## DataFrames

DataFrames are two-dimensional, size-mutable, potentially heterogeneous tabular data structures. This data structure contains TWO labeled axes (row and column)

### Creating a DataFrame

In [44]:
# From list
data = [["Adrian", 20], ["Bethany", 23], ["Chloe", 41]]

df = pd.DataFrame(data, columns=["Name", "Age"])

In [45]:
df

      Name  Age
0   Adrian   20
1  Bethany   23
2    Chloe   41

### Pandas DataFrame Research Task

#### Creating a DataFrame from a dictionary

In [60]:
data_dict = {"row1" : ["Adrian", 20], "row2" : ["Bethany", 23], "row3": ["Chloe", 41]}

In [61]:
# orient arguement in the from_dict function can be used to set dictionary keys as rows or columns
# columns arguement can be used to set custom columns

df_dict = pd.DataFrame.from_dict(data_dict, orient="index", columns=["Person", "Number"])

In [62]:
df_dict

       Person  Number
row1   Adrian      20
row2  Bethany      23
row3    Chloe      41

#### Creating a DataFrame from a list of dictionaries

In [64]:
data_dict_list = [{'Person': 'Adrian', 'Age': 20}, 
        {'Person': "Bethany", 'Age': 23}]

df_list_dict = pd.DataFrame.from_records(data_dict_list)

In [65]:
df_list_dict

    Person  Age
0   Adrian   20
1  Bethany   23

#### Creating DataFrame from a Series

In [2]:
person_list = ["A", "B", "C"]
age_list = [20, 23, 21]

person_series = pd.Series(person_list)
age_series = pd.Series(age_list)

In [3]:
# To convert series to dataframe, it must be added to a disctiory and then converted to dataframe
column_dict = {"Person" : person_series, "Age" : age_series}
series_df = pd.DataFrame(column_dict)

In [4]:
series_df

  Person  Age
0      A   20
1      B   23
2      C   21

#### Adding a series to existing DataFrame

In [6]:
city_list = ["London", "New York", "London"]
city_series = pd.Series(city_list)

In [7]:
series_df['City'] = city_series

In [8]:
series_df

  Person  Age      City
0      A   20    London
1      B   23  New York
2      C   21    London

#### Changing index of a DataFrame

In [9]:
# set_index() can be used to change index of a DataFrame
# inplace arguement needs to be set true for change to be permenant

series_df.set_index('Person')

        Age      City
Person
A        20    London
B        23  New York
C        21    London

#### Filling missing values

fillna() function can be used to fill missing values

In [ ]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", np.nan],
    "Age": [25, np.nan, 30, 35, 40],
    "City": ["New York", "Los Angeles", np.nan, "Chicago", "Houston"],
    "Salary": [50000, 60000, 70000, np.nan, 90000],
}

df = pd.DataFrame(data)

In [11]:
df.fillna("NaN Filler")

         Name         Age         City      Salary
0       Alice        25.0     New York     50000.0
1         Bob  NaN Filler  Los Angeles     60000.0
2     Charlie        30.0   NaN Filler     70000.0
3       David        35.0      Chicago  NaN Filler
4  NaN Filler        40.0      Houston     90000.0

method arguement can be given the value pad or bfill to perform a forward fill or backward fill. Forward fill fills the missing value with a previous value and backward fill fills the missing value with the next value. <br>
Note: This is an old method and is ideal to use seperate functions called ffill() and bfill() for these operations.

In [12]:
df.fillna(method='pad')

C:\Users\vidus\AppData\Local\Temp\ipykernel_31956\196241153.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='pad')

      Name   Age         City   Salary
0    Alice  25.0     New York  50000.0
1      Bob  25.0  Los Angeles  60000.0
2  Charlie  30.0  Los Angeles  70000.0
3    David  35.0      Chicago  70000.0
4    David  40.0      Houston  90000.0

In [13]:
df.ffill()

      Name   Age         City   Salary
0    Alice  25.0     New York  50000.0
1      Bob  25.0  Los Angeles  60000.0
2  Charlie  30.0  Los Angeles  70000.0
3    David  35.0      Chicago  70000.0
4    David  40.0      Houston  90000.0

#### Interpolate Function

#### Drop Values

drop() function can be used to drop columns or indexes from a DataFrame